[{"model": "news.author", "pk": 1, "fields": {"rating": 0.0, "user": 2}}, {"model": "news.author", "pk": 2, "fields": {"rating": 0.0, "user": 3}}, {"model": "news.author", "pk": 3, "fields": {"rating": 0.0, "user": 4}}, {"model": "news.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$320000$jm0D8uj9bk4bbaRN3lOPRY$gZcPB7hvfn7FVDzT3ymeWUTntYQnIBTrOkopv2H0Jnk=", "last_login": "2022-07-04T21:24:35.450Z", "is_superuser": true, "username": "admin", "first_name": "", "last_name": "", "email": "ivfmn1@gmail.com", "is_staff": true, "is_active": true, "date_joined": "2022-06-03T16:16:46.747Z", "groups": [], "user_permissions": []}}, {"model": "news.user", "pk": 2, "fields": {"password": "", "last_login": null, "is_superuser": false, "username": "Alex", "first_name": "", "last_name": "", "email": "", "is_staff": false, "is_active": true, "date_joined": "2022-06-03T16:51:02.772Z", "groups": [], "user_permissions": []}}, {"model": "news.user", "pk": 3, "fields": {"password": "", "last_login": null, "is_superuser": false, "username": "Vika", "first_name": "", "last_name": "", "email": "", "is_staff": false, "is_active": true, "date_joined": "2022-06-03T16:55:01.141Z", "groups": [], "user_permissions": []}}, {"model": "news.user", "pk": 4, "fields": {"password": "", "last_login": null, "is_superuser": false, "username": "Bob", "first_name": "", "last_name": "", "email": "", "is_staff": false, "is_active": true, "date_joined": "2022-06-03T16:55:08.812Z", "groups": [], "user_permissions": []}}, {"model": "news.post", "pk": 1, "fields": {"create_time": "2022-06-03T17:02:56.263Z", "type": "NW", "head": "Lacazette to leave Arsenal when contract expires", "text": "Alexandre Lacazette will leave Arsenal when his contract expires at the end of June, the north London club have confirmed.\r\n\r\nThe 31-year-old joined the Gunners from Lyon in the summer of 2017 and went on to score 71 goals in 206 games in north London.\r\n\r\nHowever, the goals dried up a little for Lacazette this season - he scored six in 36 games - and he and Arsenal have now decided to go their separate ways.\r\n\r\nA statement from manager Mikel Arteta posted on the club's official website said: \"Laca has been a fantastic player for us. He's been a real leader on and off the pitch and has been a very important influence to our younger players.\r\n\r\n\"His commitment with us has been exceptional and we wish him and his family success and happiness.\"\r\nTrending\r\n\r\nTechnical director Edu added: \"A big thank you to Laca from everyone at Arsenal. He's been really important for us. \"He will always be part of the Arsenal family and we wish him well for everything in the future.\"\r\n\r\nThe France international made his name at Lyon, where he found the net 129 times, after coming through the academy at the French giants and he has been linked with a move back to the Groupama Stadium this summer.", "rating": 0.0, "author": 1, "cat": [2]}}, {"model": "news.post", "pk": 2, "fields": {"create_time": "2022-06-03T17:04:28.409Z", "type": "NW", "head": "Tesla’s ‘phantom braking’ problem is getting worse, and the US government has questions 3", "text": "When last we checked in with Tesla’s “phantom braking” problem, the National Highway Traffic Safety Administration said it had received 350 complaints from owners who said their vehicles were braking for no reason. Now that number stands at 758, and the US government has some questions.\r\n\r\nOn May 4th, NHTSA fired off a 14-page “request for information” letter to Tesla about these incidents, including a request for all consumer and field reports it has received about false braking, as well as reports of crashes, injuries, deaths, and property damage claims.\r\n\"A request for all consumer and field reports it has received about false braking\"\r\n\r\nNHTSA also wants to know whether Tesla’s Full Self-Driving system was active during any of these incidents. Tesla has until June 20, 2022, to comply with the request, though it can seek an extension if it wants. (The letter was first reported by the Associated Press.)\r\n\r\nReports of “phantom braking” first surfaced last fall, when Tesla was forced to roll back version 10.3 of its Full Self-Driving (FSD) beta software, the company’s advanced driver assist system, because of issues with forward collision warnings and unexpected braking.\r\n\r\nBut after the rollback, the number of complaints actually increased substantially, with NHTSA receiving at least 107 from November to January, compared with only 34 in the preceding 22 months, according to The Washington Post. In February, NHTSA began investigating incidents involving Tesla Model 3 and Model Y vehicles after receiving 354 complaints.", "rating": 0.0, "author": 2, "cat": [4]}}, {"model": "news.post", "pk": 3, "fields": {"create_time": "2022-06-03T17:05:47.522Z", "type": "AR", "head": "Big Tech is pouring millions into the wrong climate solution at Davos", "text": "Alphabet, Microsoft, and Salesforce today pledged $500 million to new climate tech that’s supposed to pull carbon dioxide out of the atmosphere to keep it from heating up the planet. It’s the latest move by Big Tech to propel the emerging technology forward while painting themselves as global leaders when it comes to taking action on climate change.\r\n\r\nRegardless, these companies have a lot of work left to do to deal with their own emissions. Carbon dioxide removal (CDR) isn’t the solution for Big Tech’s own pollution.\r\n\r\nTo be sure, the climate crisis has gotten so bad that the United Nations’ leading climate experts acknowledge that reducing greenhouse gas emissions from fossil fuels won’t be enough anymore. We’ll also have to find ways to draw down tons of CO2 that industry has already pumped into the atmosphere, says a major United Nations climate report published in April.\r\n\"These companies have a lot of work left to do to deal with their own emissions\"\r\n\r\nThe UN report, which pulls together the consensus of hundreds of experts across the globe, emphasizes pretty specific, limited uses for CDR. It’s primarily intended to address the legacy of pollution that has piled up since the Industrial Revolution and address a small portion of current emissions that are still really difficult to get rid of using clean energy sources.\r\n\r\nSpecifically, the UN report says, “CDR to counterbalance hard-to-abate residual emissions is unavoidable” in scenarios that limit global warming to a more manageable level of 1.5 degrees Celsius. In climate policy jargon, “hard-to-abate residual emissions” typically come from just a handful of sectors. That includes heavy industry that manufactures things like cement, steel, aluminum, and chemicals. It also extends to heavy-duty transportation like shipping and aviation.\r\n\r\nThere’s just as much pressure on those industries to decarbonize as there is on Big Tech. But there are special considerations for heavy industry because it’s still much more difficult to fire up a kiln or fuel a plane with renewable energy. Batteries aren’t advanced enough to power large, electrified ships and planes for long distances without weighing them down. Cement is responsible for a significant chunk of global carbon dioxide emissions, but some of that CO2 comes from a chemical reaction in the manufacturing process — not from burning energy. That’s why those types of industries, compared to other sectors, might rely more on technologies that remove CO2 after it’s already been emitted.", "rating": 0.0, "author": 3, "cat": [3]}}, {"model": "news.post", "pk": 4, "fields": {"create_time": "2022-06-03T17:07:12.362Z", "type": "NW", "head": "US firms add more jobs than expected in May", "text": "US employers added more new jobs than expected in May with payrolls rising by 390,000, according to new data.\r\n\r\nThe figure from the US Labor Department beat economists' forecasts for a 325,0000 rise in new roles though May's increase was the slowest for a year.\r\n\r\nThe unemployment rate held at 3.6% for the third month in a row.\r\n\r\nThe health of the labour market in the world's largest economy is being closely watched as fast-rising prices raise fears of future downturn.\r\n\r\nIn recent weeks, some companies have shared plans to slow or freeze hiring.\r\n\r\nRetail giants including Walmart and Amazon have said they hired too aggressively earlier in the year and have seen their profits hit as rising prices proved more difficult to pass onto customers.", "rating": 0.0, "author": 1, "cat": [1]}}, {"model": "news.post", "pk": 5, "fields": {"create_time": "2022-06-08T16:13:14.064Z", "type": "NW", "head": "test", "text": "test 1", "rating": 0.0, "author": 2, "cat": [2]}}, {"model": "news.category", "pk": 1, "fields": {"name": "Buisness", "subscribers": []}}, {"model": "news.category", "pk": 2, "fields": {"name": "Sport", "subscribers": [1]}}, {"model": "news.category", "pk": 3, "fields": {"name": "Science", "subscribers": []}}, {"model": "news.category", "pk": 4, "fields": {"name": "Technology", "subscribers": []}}]
